tests/load/artillery.yml
# HRM Platform Load Testing Configuration
# Main configuration file for Artillery.io load tests

config:
  target: "http://localhost:3000"

  plugins:
    expect: {}
    metrics-by-endpoint: {}

  phases:
    # Warm-up phase
    - duration: 30
      arrivalRate: 5
      name: "Warm-up"

    # Ramp-up phase
    - duration: 60
      arrivalRate: 5
      rampTo: 50
      name: "Ramp-up"

    # Sustained load phase
    - duration: 120
      arrivalRate: 50
      name: "Sustained Load"

    # Peak load phase
    - duration: 60
      arrivalRate: 100
      name: "Peak Load"

    # Cool-down phase
    - duration: 30
      arrivalRate: 10
      name: "Cool-down"

  variables:
    testEmail: "loadtest{{ $randomNumber(1000, 9999) }}@test.com"
    testPassword: "LoadTest@123456"

  payload:
    path: "data/users.csv"
    fields:
      - "email"
      - "password"
    skipHeader: true
    loadAll: true

  http:
    timeout: 30
    maxSockets: 100

  ensure:
    p95: 500
    p99: 1000
    maxErrorRate: 1

scenarios:
  # Health check scenario
  - name: "Health Check"
    weight: 5
    flow:
      - get:
          url: "/api/health"
          expect:
            - statusCode: 200

  # Authentication flow
  - name: "User Login"
    weight: 20
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
          capture:
            - json: "$.data.accessToken"
              as: "token"
            - json: "$.data.user.tenantId"
              as: "tenantId"
          expect:
            - statusCode: 200
      - get:
          url: "/api/auth/me"
          headers:
            Authorization: "Bearer {{ token }}"
            X-Tenant-ID: "{{ tenantId }}"
          expect:
            - statusCode: 200

  # Employee listing
  - name: "List Employees"
    weight: 25
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
          capture:
            - json: "$.data.accessToken"
              as: "token"
            - json: "$.data.user.tenantId"
              as: "tenantId"
      - get:
          url: "/api/employees?page=1&limit=20"
          headers:
            Authorization: "Bearer {{ token }}"
            X-Tenant-ID: "{{ tenantId }}"
          expect:
            - statusCode: 200

  # Dashboard statistics
  - name: "Dashboard Stats"
    weight: 20
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
          capture:
            - json: "$.data.accessToken"
              as: "token"
            - json: "$.data.user.tenantId"
              as: "tenantId"
      - get:
          url: "/api/dashboard/stats"
          headers:
            Authorization: "Bearer {{ token }}"
            X-Tenant-ID: "{{ tenantId }}"
          expect:
            - statusCode:
                - 200
                - 404

  # Attendance operations
  - name: "Attendance Check-in/Check-out"
    weight: 15
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
          capture:
            - json: "$.data.accessToken"
              as: "token"
            - json: "$.data.user.tenantId"
              as: "tenantId"
            - json: "$.data.user._id"
              as: "userId"
      - post:
          url: "/api/attendance/check-in"
          headers:
            Authorization: "Bearer {{ token }}"
            X-Tenant-ID: "{{ tenantId }}"
          json:
            employeeId: "{{ userId }}"
            timestamp: "{{ $timestamp }}"
            location:
              latitude: 40.7128
              longitude: -74.0060
          expect:
            - statusCode:
                - 200
                - 201
                - 400

  # Leave requests
  - name: "Leave Operations"
    weight: 15
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
          capture:
            - json: "$.data.accessToken"
              as: "token"
            - json: "$.data.user.tenantId"
              as: "tenantId"
      - get:
          url: "/api/leaves/requests?page=1&limit=10"
          headers:
            Authorization: "Bearer {{ token }}"
            X-Tenant-ID: "{{ tenantId }}"
          expect:
            - statusCode: 200
      - get:
          url: "/api/leaves/balance"
          headers:
            Authorization: "Bearer {{ token }}"
            X-Tenant-ID: "{{ tenantId }}"
          expect:
            - statusCode: 200